fio/results/fio-res_201904200400
Seq-Read-1m: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Seq-Write-1m: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Rand-Read-4k-32qd: (g=2): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Write-4k-32qd: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.1
Starting 4 processes
3;fio-3.1;Seq-Read-1m;0;0;688128;68723;67;10013;53;464;76.662961;21.618509;2694;21621;14817.088705;4221.136152;1.000000%=3031;5.000000%=3424;10.000000%=5406;20.000000%=14090;30.000000%=15532;40.000000%=16056;50.000000%=16187;60.000000%=16318;70.000000%=16449;80.000000%=16908;90.000000%=17956;95.000000%=19005;99.000000%=20578;99.500000%=21102;99.900000%=21626;99.950000%=21626;99.990000%=21626;0%=0;0%=0;0%=0;2748;21682;14894.544824;4225.426127;47334;158024;78.526304%;53965.631579;25211.145631;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.000000%;0.639233%;673;0;288;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;6.40%;6.10%;85.71%;1.79%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39061;36603;0;0;366543;365546;732234;98.23%
3;fio-3.1;Seq-Write-1m;1;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;688128;68730;67;10012;55;189;96.017042;27.223841;2983;18463;14797.435043;4124.025321;1.000000%=3096;5.000000%=3293;10.000000%=3555;20.000000%=16056;30.000000%=16187;40.000000%=16187;50.000000%=16318;60.000000%=16318;70.000000%=16318;80.000000%=16449;90.000000%=16449;95.000000%=16449;99.000000%=16580;99.500000%=16908;99.900000%=18481;99.950000%=18481;99.990000%=18481;0%=0;0%=0;0%=0;3057;18530;14894.266171;4131.420402;45110;153600;75.075773%;51599.578947;24712.134413;0.039956%;0.739187%;672;0;27;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;11.31%;0.15%;88.54%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39061;36603;0;0;366543;365546;732234;98.23%
3;fio-3.1;Rand-Read-4k-32qd;2;0;134740;13459;3364;10011;2;97;9.673421;4.256059;198;20298;9496.032103;3022.952636;1.000000%=378;5.000000%=643;10.000000%=3981;20.000000%=9502;30.000000%=9764;40.000000%=9895;50.000000%=10158;60.000000%=10289;70.000000%=10420;80.000000%=10944;90.000000%=11862;95.000000%=12648;99.000000%=14090;99.500000%=14745;99.900000%=16580;99.950000%=17694;99.990000%=20054;0%=0;0%=0;0%=0;204;20309;9506.398003;3023.636236;8549;29402;71.892414%;9676.000000;4776.889841;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2.497502%;4.995005%;29407;0;62;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.13%;2.86%;2.77%;0.83%;1.77%;1.66%;33.72%;56.26%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39061;36603;0;0;366543;365546;732234;98.23%
3;fio-3.1;Rand-Write-4k-32qd;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;125036;12489;3122;10011;2;59;10.051949;2.615465;721;22441;10233.548067;1222.783922;1.000000%=3719;5.000000%=9109;10.000000%=10289;20.000000%=10420;30.000000%=10420;40.000000%=10420;50.000000%=10420;60.000000%=10420;70.000000%=10420;80.000000%=10551;90.000000%=10551;95.000000%=10551;99.000000%=10944;99.500000%=12779;99.900000%=18481;99.950000%=19791;99.990000%=21626;0%=0;0%=0;0%=0;746;22450;10244.211115;1222.999878;12297;17311;100.000000%;12564.600000;1117.222185;3.056943%;3.826174%;30776;0;28;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.02%;0.03%;0.07%;1.11%;4.37%;94.36%;0.04%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39061;36603;0;0;366543;365546;732234;98.23%

Seq-Read-1m: (groupid=0, jobs=1): err= 0: pid=18371: Sat Apr 20 04:00:42 2019
   read: IOPS=67, BW=67.1MiB/s (70.4MB/s)(672MiB/10013msec)
    slat (usec): min=53, max=464, avg=76.66, stdev=21.62
    clat (usec): min=2694, max=21621, avg=14817.09, stdev=4221.14
     lat (usec): min=2748, max=21682, avg=14894.54, stdev=4225.43
    clat percentiles (usec):
     |  1.00th=[ 3032],  5.00th=[ 3425], 10.00th=[ 5407], 20.00th=[14091],
     | 30.00th=[15533], 40.00th=[16057], 50.00th=[16188], 60.00th=[16319],
     | 70.00th=[16450], 80.00th=[16909], 90.00th=[17957], 95.00th=[19006],
     | 99.00th=[20579], 99.50th=[21103], 99.90th=[21627], 99.95th=[21627],
     | 99.99th=[21627]
   bw (  KiB/s): min=47334, max=158024, per=78.53%, avg=53965.63, stdev=25211.15, samples=19
   iops        : min=   46, max=  154, avg=52.16, stdev=24.67, samples=19
  lat (msec)   : 4=6.40%, 10=6.10%, 20=85.71%, 50=1.79%
  cpu          : usr=0.00%, sys=0.64%, ctx=673, majf=0, minf=288
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=672,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Seq-Write-1m: (groupid=1, jobs=1): err= 0: pid=18372: Sat Apr 20 04:00:42 2019
  write: IOPS=67, BW=67.1MiB/s (70.4MB/s)(672MiB/10012msec)
    slat (usec): min=55, max=189, avg=96.02, stdev=27.22
    clat (usec): min=2983, max=18463, avg=14797.44, stdev=4124.03
     lat (usec): min=3057, max=18530, avg=14894.27, stdev=4131.42
    clat percentiles (usec):
     |  1.00th=[ 3097],  5.00th=[ 3294], 10.00th=[ 3556], 20.00th=[16057],
     | 30.00th=[16188], 40.00th=[16188], 50.00th=[16319], 60.00th=[16319],
     | 70.00th=[16319], 80.00th=[16450], 90.00th=[16450], 95.00th=[16450],
     | 99.00th=[16581], 99.50th=[16909], 99.90th=[18482], 99.95th=[18482],
     | 99.99th=[18482]
   bw (  KiB/s): min=45110, max=153600, per=75.08%, avg=51599.58, stdev=24712.13, samples=19
   iops        : min=   44, max=  150, avg=50.05, stdev=24.21, samples=19
  lat (msec)   : 4=11.31%, 10=0.15%, 20=88.54%
  cpu          : usr=0.04%, sys=0.74%, ctx=672, majf=0, minf=27
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,672,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4k-32qd: (groupid=2, jobs=1): err= 0: pid=18373: Sat Apr 20 04:00:42 2019
   read: IOPS=3364, BW=13.1MiB/s (13.8MB/s)(132MiB/10011msec)
    slat (nsec): min=2463, max=97611, avg=9673.42, stdev=4256.06
    clat (usec): min=198, max=20298, avg=9496.03, stdev=3022.95
     lat (usec): min=204, max=20309, avg=9506.40, stdev=3023.64
    clat percentiles (usec):
     |  1.00th=[  379],  5.00th=[  644], 10.00th=[ 3982], 20.00th=[ 9503],
     | 30.00th=[ 9765], 40.00th=[ 9896], 50.00th=[10159], 60.00th=[10290],
     | 70.00th=[10421], 80.00th=[10945], 90.00th=[11863], 95.00th=[12649],
     | 99.00th=[14091], 99.50th=[14746], 99.90th=[16581], 99.95th=[17695],
     | 99.99th=[20055]
   bw (  KiB/s): min= 8549, max=29402, per=71.89%, avg=9676.00, stdev=4776.89, samples=19
   iops        : min= 2137, max= 7350, avg=2418.63, stdev=1194.19, samples=19
  lat (usec)   : 250=0.13%, 500=2.86%, 750=2.77%, 1000=0.83%
  lat (msec)   : 2=1.77%, 4=1.66%, 10=33.72%, 20=56.26%, 50=0.01%
  cpu          : usr=2.50%, sys=5.00%, ctx=29407, majf=0, minf=62
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=33685,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Write-4k-32qd: (groupid=3, jobs=1): err= 0: pid=18374: Sat Apr 20 04:00:42 2019
  write: IOPS=3122, BW=12.2MiB/s (12.8MB/s)(122MiB/10011msec)
    slat (nsec): min=2949, max=59746, avg=10051.95, stdev=2615.47
    clat (usec): min=721, max=22441, avg=10233.55, stdev=1222.78
     lat (usec): min=746, max=22450, avg=10244.21, stdev=1223.00
    clat percentiles (usec):
     |  1.00th=[ 3720],  5.00th=[ 9110], 10.00th=[10290], 20.00th=[10421],
     | 30.00th=[10421], 40.00th=[10421], 50.00th=[10421], 60.00th=[10421],
     | 70.00th=[10421], 80.00th=[10552], 90.00th=[10552], 95.00th=[10552],
     | 99.00th=[10945], 99.50th=[12780], 99.90th=[18482], 99.95th=[19792],
     | 99.99th=[21627]
   bw (  KiB/s): min=12297, max=17311, per=100.00%, avg=12564.60, stdev=1117.22, samples=20
   iops        : min= 3074, max= 4327, avg=3140.85, stdev=279.20, samples=20
  lat (usec)   : 750=0.02%, 1000=0.03%
  lat (msec)   : 2=0.07%, 4=1.11%, 10=4.37%, 20=94.36%, 50=0.04%
  cpu          : usr=3.06%, sys=3.83%, ctx=30776, majf=0, minf=28
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,31259,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=67.1MiB/s (70.4MB/s), 67.1MiB/s-67.1MiB/s (70.4MB/s-70.4MB/s), io=672MiB (705MB), run=10013-10013msec

Run status group 1 (all jobs):
  WRITE: bw=67.1MiB/s (70.4MB/s), 67.1MiB/s-67.1MiB/s (70.4MB/s-70.4MB/s), io=672MiB (705MB), run=10012-10012msec

Run status group 2 (all jobs):
   READ: bw=13.1MiB/s (13.8MB/s), 13.1MiB/s-13.1MiB/s (13.8MB/s-13.8MB/s), io=132MiB (138MB), run=10011-10011msec

Run status group 3 (all jobs):
  WRITE: bw=12.2MiB/s (12.8MB/s), 12.2MiB/s-12.2MiB/s (12.8MB/s-12.8MB/s), io=122MiB (128MB), run=10011-10011msec

Disk stats (read/write):
  xvda: ios=39061/36603, merge=0/0, ticks=366543/365546, in_queue=732234, util=98.23%